# Решение заданий тех что не успели решить

Описание emoji 

⏩ - Задание 

❗ - Мои вопросы
## Задание №6
 ⏩ Напишите программу, которая запрашивает год и проверяет его на високосность.

 ⏩ Распишите все возможные проверки в цепочке elif

 ⏩ Откажитесь от магических чисел

 ⏩ Обязательно учтите год ввода Григорианского календаря

 ⏩ В коде должны быть один input и один print
```python
year = int(input('Введите год в формате yyyy: '))


def yer_ves(arg):
    """Функция, которая определяет являться ли год високосным"""
    if arg % 4 != 0:
        return print("Обычный")
    elif arg % 100 == 0:
        if arg % 400 == 0:
            return print("Високосный")
        else:
            return print("Обычный")
    else:
        return print("Високосный")


def year_ves_tern(arg):
    """Функция, которая определяет являться ли год високосным с использованием тернальника"""
    if arg % 4 != 0 or arg % 100 == 0 and arg % 400 != 0:
        return print("Обычный")
    else:
        return print("Високосный")


yer_ves(year)
print('=' * 50)
year_ves_tern(year)
```

## Задание №7


 ⏩ Пользователь вводит число от 1 до 999. Используя операции с числами сообщите что введено: цифра,
 двузначное число или трёхзначное число.

 ⏩ Для цифры верните её квадрат, например 5 - 25

 ⏩ Для двузначного числа произведение цифр, например 30 - 0

 ⏩ Для трёхзначного числа его зеркальное отображение, например 520 - 25

 ⏩ Если число не из диапазона, запросите новое число

 ⏩ Откажитесь от магических чисел

 ⏩ В коде должны быть один input и один print

```python
import random as rand


answer = int(input('Введите число: '))


# answer = rand.randint(1, 999)  # мне было лень вводить каждый раз с клавиатуры поэтому ткт блок рандома
# print(f'Рандомное число = {answer}')


def check_int(arg):
    while True:
        if arg == int:
            print('Вы ввели число поэтому, вы проходите дальше')
            chill_check(arg)
            break
        else:
            print('Вы ввели строку\nПопробуйте снова ')
            continue


def chill_check(arg, count=0):
    """Функцию, которая проверяет числа"""
    if 1 <= arg <= 999:
        if 10 <= arg <= 99:
            print('Число двухзначное')
        elif arg >= 100 <= 999:
            print('Число трехзначное')
        else:
            print('число однозначное')
    else:
        print('Вы вышли за пределы чисел')


check_int(answer)
```

начал я в общем расписывать пока не дочитал условие до конца, а именно
(я бы насоздавал ббы функции на каждый случай и вызывал бы их по очередности)

⏩ В коде должны быть один input и один print
Единственный варинт решать его через тернарного операции

## Версия 2
⏩ 1. Пользователь вводит число от 1 до 999. Используя операции с числами сообщите что введено: цифра,
двузначное число или трёхзначное число.

❗ Тут не понятная формулировка! Ели нужно вывести что это цифра то нужна проверка ?  ее сделал, но она не верная
(поскольку если в input() не присвоить на входе int то она всегда будет строкой, поэтому проверка бесполезная)

⏩ 2. Для цифры верните её квадрат, например 5 - 25

 ❗ Если для цифры нужно вернуть ее квадрат, исходя из первого пункта, что нужно вернуть из строки ? 

 ❗ Не понятно, на входе, что бы коректно сработало булевое сравнение и выявление двухзначного числа или трехзначного,
необходимо конвертировать в int то-есть получается возводиться в квадрат любые введенные числа??

 ❗ в условии сказано, что нужно использовать return, но у тернарного оператора нет этой функции, а использование все кроме тернарного оператора противоречит условию №7

⏩ 3. Для двузначного числа произведение цифр, например 30 - 0

 ❗ тут нужно разбить по индексам и сложить ?

 ⏩ 4. Для трёхзначного числа его зеркальное отображение, например 520 - 25

 ❗не представляю как выводить по индексу для перестановки? Сделал как смог

 ⏩ 5. Если число не из диапазона, запросите новое число

 ⏩ 6. Откажитесь от магических чисел

 ⏩ 7. В коде должны быть один input и один print

 ❗В общем очень сложное задание для новичка !!!
```python
answer = int(input("Введите число от 1 до 999: "))

result = ((answer ** 2) if answer < 10 else
          ((answer // 10) * (answer % 10)) if answer < 100 else
          str(answer)[::-1]) if 1 <= answer <= 999 else "Число не входит в диапазон от 1 до 999"

print(result)
```

## Задание 8
⏩ Нарисовать в консоли ёлку спросив у пользователя количество рядов.

⏩ Пример результата:
 Сколько рядов у ёлки? 5
    *
   ***
  *****
 *******
*********

```python
print('''
    *
   ***
  *****
 *******
*********
''')

el = input('сколько рядов у елки?')

print('Молодец!\nУмеешь считать!' if el == 5 else 'Увы это не правильный ответ!')

```

## задание 9 

⏩Выведите в консоль таблицу умножения от 2х2 до 9х10 как на школьной тетрадке

❗ Тут тоже не понятно каким методом выводить ? Можно просто через print() а можно и через for.
Каждый выбирает сам как решать эту задачу ?

```python
print('''
2x2=4	3x2=6	4x2=8	5x2=10	6x2=12	7x2=14	8x2=16	9x2=18	
2x3=6	3x3=9	4x3=12	5x3=15	6x3=18	7x3=21	8x3=24	9x3=27	
2x4=8	3x4=12	4x4=16	5x4=20	6x4=24	7x4=28	8x4=32	9x4=36	
2x5=10	3x5=15	4x5=20	5x5=25	6x5=30	7x5=35	8x5=40	9x5=45	
2x6=12	3x6=18	4x6=24	5x6=30	6x6=36	7x6=42	8x6=48	9x6=54	
2x7=14	3x7=21	4x7=28	5x7=35	6x7=42	7x7=49	8x7=56	9x7=63	
2x8=16	3x8=24	4x8=32	5x8=40	6x8=48	7x8=56	8x8=64	9x8=72	
2x9=18	3x9=27	4x9=36	5x9=45	6x9=54	7x9=63	8x9=72	9x9=81	
2x10=20	3x10=30	4x10=40	5x10=50	6x10=60	7x10=70	8x10=80	9x10=90
''')

def table_umn():
    for i in range(2, 11):
        for j in range(2, 10):
            print(f"{j}x{i}={j*i}", end="\t")
        print()


table_umn()
```